Documents/упСобытиеМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упСобытиеМониторинга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упОтветыНаЗапросыМобильныйКлиент</xr:Item>
				<xr:Item>InformationRegister.упДатыСобытий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТочки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьЗвонка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗвонокПропущен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проблема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПроблемыВПути</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыСобытияМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трекер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМобильныеУстройстваИТрекеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГеографическаяКоордината</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТочки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗапросовМобильныйКлиент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонОстаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачОстаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упСтатусыСобытияМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыСобытияМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТипыСобытийМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТипыСобытийМониторинга</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыСобытийМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастотаОповещения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОстановки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погрешность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Расстояние</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Датчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыСравненияЗначенийДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеДатчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.упЗначенияДатчиков</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрешностьВремя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипыИзмененийЗначенийДатчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФиксироватьСобытиеВТочкеМаршрута</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодИзменения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Время</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПрохождениеТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаймаутОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦиклическиФиксироватьСобытиеМониторинга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксироватьОтветВодителяПоСобытию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВопросаИОтветов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНастройкиВопросаИОтветовПоСобытиямМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастраиваемоеСобытиеAndroidКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнициирующиеМониторингДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтменяющиеМониторингДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФиксирующиеСобытиеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДействия</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упТипыДействийСобытийМониторинга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/упСобытиеМониторинга/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Статус = ПредопределенноеЗначение("Перечисление.упСтатусыСобытияМониторинга.Новое");
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;	
	
	Если Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ВходящийЗвонок
		ИЛИ Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ИсходящийЗвонок Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗвонок;
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.НачалоРаботВТочкеМаршрута
		ИЛИ Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ПрибытиеВТочкуМаршрута
		ИЛИ Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.УбытиеСТочкиМаршрута
		ИЛИ Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ТочкаПропущена
		ИЛИ Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ИзменениеСледующейТочкиПоМаршруту Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСобытиеСТочкой;
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.СообщениеДиспетчеру Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВходящееСообщение;
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.СообщениеОтДиспетчера Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтправленноеСообщение;
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ОтсутствиеЛицензииНаПодключение 
		Или Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаОптимизациюМаршрута Тогда 	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтсутствиеЛицензииНаПодключение;
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаДосрочноеЗавершениеРейса Тогда 	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗапросБезАдреса;	
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаДосрочноеУбытиеИзТочкиМаршрута
		Или Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗапросНаНазначениеТочкиСледующейПоМаршруту Тогда 	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗапросСАдресом;		
	ИначеЕсли Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.ЗаправкаТоплива
		ИЛИ Объект.ТипСобытия = Справочники.упТипыСобытийМониторинга.СливТоплива Тогда 
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСобытиеТоплива;
	ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипСобытия, "НастраиваемоеСобытиеAndroidКлиента") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаНастраиваемоеСобытиеМониторинга;
	Иначе	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПустая;
	КонецЕсли;	
	
	упСервисныеФункцииВызовСервера.ОтобразитьПрицепыТранспортногоСредства(ЭтотОбъект, Объект.ТранспортноеСредство, Объект.ДатаЗаписи);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) 
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.упСтатусыСобытияМониторинга.Обрабатывается") Тогда
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	упСервисныеФункцииВызовСервера.ОтобразитьПрицепыТранспортногоСредства(ЭтотОбъект, ТекущийОбъект.ТранспортноеСредство, ТекущийОбъект.ДатаЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
    Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
        РезультатВыполнения = Неопределено;
        ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
        ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
    КонецЕсли;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	ТранспортноеСредствоПриИзмененииНаСервере() 
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) 
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.упСтатусыСобытияМониторинга.Обрабатывается") Тогда
		ТекстСообщения = НСтр("ru = 'Укажите ответственного пользователя.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Ответственный");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
    ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()    	
	упСервисныеФункцииВызовСервера.ОтобразитьПрицепыТранспортногоСредства(ЭтотОбъект, Объект.ТранспортноеСредство, Объект.ДатаЗаписи);
КонецПроцедуры

#КонецОбласти
